app/controllers/application_controller.rb

  def fetch_user
    #set up @current_user once someone has lgged in
    @current_user = User.find_by :id => session[:user_id] if session[:user_id].present?
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]