app/controllers/wines_controller.rb

def index
  @wines = Wine.all
---
SELECT "wines".* FROM "wines"

  def create
    wine = Wine.new
    wine.color = params[:color]
    wine.name = params[:name]
    wine.region = params[:region]
    wine.image = params[:image]
    wine.save
---
INSERT INTO "wines" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2018-07-16 23:39:41.103183"], ["updated_at", "2018-07-16 23:39:41.103183"]]